<a href="https://colab.research.google.com/github/treyra/CS155_miniproject/blob/data_visualization_v1/Data_Imputation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Notebook for data imputation - in progress

Import statements

In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/treyra/CS155_miniproject/master/WILDFIRES_TRAIN.csv',sep=',', header=0)
df.head()

   id   LATITUDE   LONGITUDE  ...   SOURCE_REPORTING_UNIT_NAME        DATE  LABEL
0   0  38.205000 -120.335000  ...   Stanislaus National Forest  1992-01-01      1
1   1  33.813100  -85.104300  ...  Georgia Forestry Commission  1992-01-01      4
2   2  32.201000  -82.498700  ...  Georgia Forestry Commission  1992-01-01      2
3   3  32.509300  -81.708600  ...  Georgia Forestry Commission  1992-01-01      4
4   4  33.663889 -116.171944  ...         CDF - Riverside Unit  1992-01-01      2

[5 rows x 11 columns]

In [5]:
# convert State from strings to numbers
df['STATE'] = df['STATE'].replace(['CA'],'1')
df['STATE'] = df['STATE'].replace(['GA'],'2')
df.head()

   id   LATITUDE   LONGITUDE  ...   SOURCE_REPORTING_UNIT_NAME        DATE  LABEL
0   0  38.205000 -120.335000  ...   Stanislaus National Forest  1992-01-01      1
1   1  33.813100  -85.104300  ...  Georgia Forestry Commission  1992-01-01      4
2   2  32.201000  -82.498700  ...  Georgia Forestry Commission  1992-01-01      2
3   3  32.509300  -81.708600  ...  Georgia Forestry Commission  1992-01-01      4
4   4  33.663889 -116.171944  ...         CDF - Riverside Unit  1992-01-01      2

[5 rows x 11 columns]

In [13]:
df.STATE.unique()

array(['1', '2'], dtype=object)

In [19]:
len(df.FIPS_NAME.unique())

216

In [20]:
df.FIPS_CODE.unique()
len(df.FIPS_CODE.unique())

162

In [28]:
# transform FIPS_NAME in integer
for i,fipsname in enumerate(df.FIPS_NAME.unique()):
  df['FIPS_NAME'] = df['FIPS_NAME'].replace([str(fipsname)],[i])

In [32]:
# transform SOURCE_REPORTING_UNIT_NAME in integer
for i,unitname in enumerate(df.SOURCE_REPORTING_UNIT_NAME.unique()):
  df['SOURCE_REPORTING_UNIT_NAME'] = df['SOURCE_REPORTING_UNIT_NAME'].replace([str(unitname)],[i])

In [33]:
df.head()

   id   LATITUDE   LONGITUDE  ... SOURCE_REPORTING_UNIT_NAME        DATE  LABEL
0   0  38.205000 -120.335000  ...                          0  1992-01-01      1
1   1  33.813100  -85.104300  ...                          1  1992-01-01      4
2   2  32.201000  -82.498700  ...                          1  1992-01-01      2
3   3  32.509300  -81.708600  ...                          1  1992-01-01      4
4   4  33.663889 -116.171944  ...                          2  1992-01-01      2

[5 rows x 11 columns]

In [38]:
# set all missing values to np.nan for simple imputer to work (just to make sure)
df.fillna(np.nan)

            id   LATITUDE  ...        DATE LABEL
0            0  38.205000  ...  1992-01-01     1
1            1  33.813100  ...  1992-01-01     4
2            2  32.201000  ...  1992-01-01     2
3            3  32.509300  ...  1992-01-01     4
4            4  33.663889  ...  1992-01-01     2
...        ...        ...  ...         ...   ...
285377  285377  32.359105  ...  2009-12-30     4
285378  285378  38.346342  ...  2009-12-30     2
285379  285379  32.780596  ...  2009-12-30     2
285380  285380  33.985000  ...  2009-12-30     2
285381  285381  33.470031  ...  2009-12-31     2

[285382 rows x 11 columns]

In [48]:
# replacing missing values with most frequent
# probably not the best idea, should instead learn the fips name and code from lat+lon
# no idea about discovery time
from sklearn.impute import SimpleImputer
imp = SimpleImputer(missing_values= np.nan, strategy='most_frequent')
imp.fit(df)
imp.transform(df)
T=imp.transform(df)
# make pandas frame again from imputed data
df2 = pd.DataFrame({'id': T[:, 0], 'LATITUDE': T[:, 1], 'LONGITUDE': T[:, 2], 'STATE': T[:, 3], 'DISCOVERY_TIME': T[:, 4], 'FIRE_SIZE': T[:, 5], 'FIPS_NAME': T[:, 6], 'FIPS_CODE': T[:, 7], 'SOURCE_REPORTING_UNIT_NAME': T[:, 8], 'DATE': T[:, 9], 'LABEL': T[:, 10]})
df2.head()

  id LATITUDE LONGITUDE  ... SOURCE_REPORTING_UNIT_NAME        DATE LABEL
0  0   38.205  -120.335  ...                          0  1992-01-01     1
1  1  33.8131  -85.1043  ...                          1  1992-01-01     4
2  2   32.201  -82.4987  ...                          1  1992-01-01     2
3  3  32.5093  -81.7086  ...                          1  1992-01-01     4
4  4  33.6639  -116.172  ...                          2  1992-01-01     2

[5 rows x 11 columns]

In [47]:
# maybe use K-Nearest Neighbor to impute data
from scipy.spatial import KDTree
kdtree = KDTree(df, leafsize=10)
# to be continued

TypeError: ignored